docs/assign05.org
#+TITLE: SWE 619 Assignment 5 

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">

* Goals: Immutablity via Bloch Item 50

  Revisit the Period example [[./inclass04B.html][In-Class 4B]].

  Implement a satisfying solution to question 3. That is, you should not only break the immutability of the =Period= class by writing a suitable sublcass, but you should also develop a plausible case where a client ends up "in trouble" due to the loss of immutability.

  Turn in a *story*.

* Grading Criteria

  Grading is in part the technical aspect of breaking immutability, and in part that your client case is plausible.


* Links
  - [[./index.html][Syllabus]]
  - [[./schedule.html][Schedule]]

