docs/assign05.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-06 Tue 20:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 5</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 5</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga289f1e">1. Goals: Immutablity via Bloch Item 50</a></li>
<li><a href="#orgeb86629">2. Grading Criteria</a></li>
<li><a href="#orgaf9795f">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga289f1e" class="outline-2">
<h2 id="orga289f1e"><span class="section-number-2">1</span> Goals: Immutablity via Bloch Item 50</h2>
<div class="outline-text-2" id="text-1">
<p>
Revisit the Period example <a href="./inclass04B.html">In-Class 4B</a>.
</p>

<p>
Implement a satisfying solution to question 3. That is, you should not only break the immutability of the <code>Period</code> class by writing a suitable sublcass, but you should also develop a plausible case where a client ends up "in trouble" due to the loss of immutability.
</p>

<p>
Turn in a <b>story</b>.
</p>
</div>
</div>

<div id="outline-container-orgeb86629" class="outline-2">
<h2 id="orgeb86629"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<p>
Grading is in part the technical aspect of breaking immutability, and in part that your client case is plausible.
</p>
</div>
</div>


<div id="outline-container-orgaf9795f" class="outline-2">
<h2 id="orgaf9795f"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
